config/ext/Enums/СостоянияЭтаповПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповПроцесса</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бэклог</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подпроцесс</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/ext/Catalogs/Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Процессы</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НавСсылка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЭтапа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭтаповПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/ext/Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияСвязи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииСвязи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Местоположения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РолиКонтактногоЛица</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольКонтактногоЛица</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/ext/CommonModules/ЗаданияСервер/Ext/Module.bsl
//Пашков
Функция ЕстьНезакрытыеПодчиненныеЗадания(Основание, Задание) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьНезакрытыеПодчиненныеЗадания", Ложь);
	Результат.Вставить("Сообщение", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
               |	СвязанныеДокументы.Ссылка КАК Ссылка
               |ПОМЕСТИТЬ ПодчиненныеДокументы
               |ИЗ
               |	КритерийОтбора.СвязанныеДокументы(&Основание) КАК СвязанныеДокументы
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ РАЗЛИЧНЫЕ
               |	Задание.Ссылка КАК Ссылка,
               |	Задание.Дата КАК Дата,
               |	Задание.Номер КАК Номер,
               |	Задание.ТекущийЭтап КАК ТекущийЭтап
               |ИЗ
               |	ПодчиненныеДокументы КАК ПодчиненныеДокументы
               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Задание КАК Задание
               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроцессов КАК ЭтапыПроцессов
               |			ПО Задание.ТекущийЭтап = ЭтапыПроцессов.Ссылка
               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Процессы КАК Процессы
               |			ПО Задание.Процесс = Процессы.Ссылка
               |		ПО ПодчиненныеДокументы.Ссылка = Задание.Ссылка
               |ГДЕ
               |	Задание.Проведен
               |	И Задание.Ссылка <> &Задание
               |	И ЭтапыПроцессов.СостояниеЭтапа <> ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповПроцесса.Закрыт)
               |	И Процессы.ТипПроцесса = &ТипПроцесса_Задача";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("ТипПроцесса_Задача", Справочники.ТипыПроцессов.ЗапросНаИзменение);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Сообщение = "";
		Пока Выборка.Следующий() Цикл
			
			Сообщение = Сообщение + Символы.ПС + Выборка.Дата + " " + Выборка.Номер + " статус: " + Выборка.ТекущийЭтап;
			
		КонецЦикла;
		
		Результат.ЕстьНезакрытыеПодчиненныеЗадания = Истина;
		Результат.Сообщение = Сообщение;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЭтапПроцессаПоСостоянию(Задание, Состояние) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроцессыЭтапы.Этап КАК Этап
		|ИЗ
		|	Справочник.Процессы.Этапы КАК ПроцессыЭтапы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроцессов КАК ЭтапыПроцессов
		|		ПО ПроцессыЭтапы.Этап = ЭтапыПроцессов.Ссылка
		|ГДЕ
		|	ПроцессыЭтапы.Ссылка = &Процесс И
		|	ЭтапыПроцессов.СостояниеЭтапа = &Состояние";
	
	Запрос.УстановитьПараметр("Процесс", Задание.Процесс);
	Запрос.УстановитьПараметр("Состояние", Состояние);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Этап;
	Иначе
		Возврат Неопределено;
	КонецЕсли;;
	
КонецФункции

&Вместо("ПолучитьСтруктуруПриПереходеЗаданияНаЭтап")
Функция РСК_ПолучитьСтруктуруПриПереходеЗаданияНаЭтап(Знач Объект, Знач КонечныйЭтап, Знач ВернутьСтруктуруПоУмолчанию)
	Результат = ПродолжитьВызов(Объект, КонечныйЭтап, ВернутьСтруктуруПоУмолчанию);
	
	Результат.Вставить("ТипПроцесса", ?(ТипЗнч(Объект) = Тип("ДокументСсылка.Задание"), Объект.ТипПроцесса, Объект.Ссылка.ТипПроцесса));
	
	Возврат Результат;
КонецФункции

Функция ПолучитьСписокОснований(ДокументЗадание) Экспорт
	
	Основания = Новый Массив;
	
	Для каждого СтрокаОснование Из ДокументЗадание.Основания Цикл
		
		Основание = СтрокаОснование.Основание;
		
		Если ТипЗнч(Основание) <> Тип("ДокументСсылка.Задание")
			ИЛИ Основание.ТипПроцесса <> ПредопределенноеЗначение("Справочник.ТипыПроцессов.Инцидент") Тогда
			Продолжить;
		КонецЕсли;
		
		Основания.Добавить(Основание);
		
	КонецЦикла;
	
	Возврат Основания;
	
КонецФункции

Функция СовпадаетИсполнитель(ДокументЗадание, Основание) Экспорт
	
	Возврат ДокументЗадание.ТекущийИсполнитель = Основание.ТекущийИсполнитель;
	
КонецФункции

&Вместо("ПолучитьСписокВыбораИнициатора")
Функция РСК_ПолучитьСписокВыбораИнициатора(Знач СтрокаПоиска)
	
	СписокВыбораИнициатора = Новый СписокЗначений;

	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор", Новый Структура("ПометкаУдаления", Ложь));
	ПараметрыВыбора.Вставить("СтрокаПоиска", СтрокаПоиска);
	ПараметрыВыбора.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	
	
	//ДанныеВыбораИнициатораПользователи 	= Справочники.Пользователи.ПолучитьДанныеВыбора(ПараметрыВыбора);
	//ДанныеВыбораИнициатораФизЛица 		= Справочники.ФизическиеЛица.ПолучитьДанныеВыбора(ПараметрыВыбора);
	//ДанныеВыбораСотрудника				= Справочники.Сотрудники.ПолучитьДанныеВыбора(ПараметрыВыбора);
	ДанныеВыбораКонтактныеЛица			= Справочники.КонтактныеЛица.ПолучитьДанныеВыбора(ПараметрыВыбора);
	//ДанныеВыбораИнициатораКонтрагенты	= Справочники.Контрагенты.ПолучитьДанныеВыбора(ПараметрыВыбора);
	//ДанныеВыбораИнициатораПодразделения	= Справочники.Подразделения.ПолучитьДанныеВыбора(ПараметрыВыбора);
	//ДанныеВыбораОрганизации				= Справочники.Организации.ПолучитьДанныеВыбора(ПараметрыВыбора);
	//ДанныеВыбораПотенциальногоКлиента	= Справочники.ПотенциальныеКлиенты.ПолучитьДанныеВыбора(ПараметрыВыбора);
	//
	//ДанныеВыбораОрганизации				= Справочники.Организации.ПолучитьДанныеВыбора(ПараметрыВыбора);
		
	//Для Каждого ЭлементСписка Из ДанныеВыбораИнициатораПользователи Цикл
	//	Постфикс = НСтр("ru = '(пользователь)'");
	//	СписокВыбораИнициатора.Добавить(ЭлементСписка.Значение,
	//		УправлениеITОтделом8УФ.ФорматироватьСтрокуНайденнойПодстроки(Строка(ЭлементСписка.Представление) 
	//			+ " " + Постфикс, СтрокаПоиска));
	//КонецЦикла;
	//Для Каждого ЭлементСписка Из ДанныеВыбораИнициатораФизЛица Цикл
	//	Постфикс = НСтр("ru = '(физлицо)'");
	//	СписокВыбораИнициатора.Добавить(ЭлементСписка.Значение,
	//		УправлениеITОтделом8УФ.ФорматироватьСтрокуНайденнойПодстроки(Строка(ЭлементСписка.Представление) 
	//			+ " " + Постфикс, СтрокаПоиска));
	//КонецЦикла;
	Для Каждого ЭлементСписка Из ДанныеВыбораКонтактныеЛица Цикл
		Постфикс = НСтр("ru = '(контактное лицо)'");
		СписокВыбораИнициатора.Добавить(ЭлементСписка.Значение,
			УправлениеITОтделом8УФ.ФорматироватьСтрокуНайденнойПодстроки(Строка(ЭлементСписка.Представление) 
			+ " " + Постфикс, СтрокаПоиска));
	КонецЦикла;	
	//Для Каждого ЭлементСписка Из ДанныеВыбораИнициатораКонтрагенты Цикл
	//	Постфикс = НСтр("ru = '(контрагент)'");
	//	СписокВыбораИнициатора.Добавить(ЭлементСписка.Значение,
	//		УправлениеITОтделом8УФ.ФорматироватьСтрокуНайденнойПодстроки(Строка(ЭлементСписка.Представление) 
	//			+ " " + Постфикс, СтрокаПоиска));
	//КонецЦикла;
	//Для Каждого ЭлементСписка Из ДанныеВыбораСотрудника Цикл
	//	Постфикс = НСтр("ru = '(сотрудник)'");
	//	СписокВыбораИнициатора.Добавить(ЭлементСписка.Значение, 
	//		УправлениеITОтделом8УФ.ФорматироватьСтрокуНайденнойПодстроки(Строка(ЭлементСписка.Представление) 
	//			+ " " + Постфикс, СтрокаПоиска));
	//КонецЦикла;
	//Для Каждого ЭлементСписка Из ДанныеВыбораИнициатораПодразделения Цикл
	//	Постфикс = НСтр("ru = '(подразделение)'");
	//	СписокВыбораИнициатора.Добавить(ЭлементСписка.Значение, 
	//		УправлениеITОтделом8УФ.ФорматироватьСтрокуНайденнойПодстроки(Строка(ЭлементСписка.Представление) 
	//			+ " " + Постфикс, СтрокаПоиска));
	//КонецЦикла;
	//Для Каждого ЭлементСписка Из ДанныеВыбораОрганизации Цикл
	//	Постфикс = НСтр("ru = '(организация)'");
	//	СписокВыбораИнициатора.Добавить(ЭлементСписка.Значение, 
	//		УправлениеITОтделом8УФ.ФорматироватьСтрокуНайденнойПодстроки(Строка(ЭлементСписка.Представление) 
	//			+ " " + Постфикс, СтрокаПоиска));
	//КонецЦикла;
	//Для Каждого ЭлементСписка Из ДанныеВыбораПотенциальногоКлиента Цикл
	//	Постфикс = НСтр("ru = '(потенциальный клиент)'");
	//	СписокВыбораИнициатора.Добавить(ЭлементСписка.Значение, 
	//		УправлениеITОтделом8УФ.ФорматироватьСтрокуНайденнойПодстроки(Строка(ЭлементСписка.Представление) 
	//			+ " " + Постфикс, СтрокаПоиска));
	//КонецЦикла;
	
    Возврат СписокВыбораИнициатора;
    
КонецФункции

//++ РС Консалт: Полякова Елизавета Линоровна 20.02.2021 Задача 2109
//e1cib/data/Документ.Задание?ref=99ae48a6e71f81304c58fd0f857de675
&Вместо("ЗаполнитьСписокВыбораСтатусовЗаданий")
Процедура РСК_ЗаполнитьСписокВыбораСтатусовЗаданий(СписокВыбора) Экспорт
	СписокВыбора.Очистить();
	//СписокВыбора.Добавить("Новые", 					НСтр("ru = 'Новые'"));
	СписокВыбора.Добавить("Измененные", 				НСтр("ru = 'Измененные'"));
	//СписокВыбора.Добавить("ВРаботе", 					НСтр("ru = 'В работе'"));
	СписокВыбора.Добавить("НовыеВРаботе", 				НСтр("ru = 'Новые + В работе'"));	
	СписокВыбора.Добавить("Выполненные", 				НСтр("ru = 'Выполненные'"));
	//СписокВыбора.Добавить("Завершенные", 				НСтр("ru = 'Завершенные'"));
	СписокВыбора.Добавить("ВыполненныНоНеЗавершенные", 	НСтр("ru = 'Выполненные, но не завершенные'"));
	СписокВыбора.Добавить("НеЗакрытыеРС",				НСтр("ru = 'Не закрытые (РС)'"));
	//СписокВыбора.Добавить("ВыполненныеЗаНеделю",		НСтр("ru = 'Выполненные за неделю'"));
	//СписокВыбора.Добавить("Приостановлено", 			НСтр("ru = 'Приостановлено'"));
	//СписокВыбора.Добавить("Просрочено", 				НСтр("ru = 'Просрочено (Все)'"));
	//СписокВыбора.Добавить("ПросроченоНовыеВРаботе", 	НСтр("ru = 'Просрочено (Новые + В работе)'"));
	//СписокВыбора.Добавить("ПросроченоВыполненные", 		НСтр("ru = 'Просрочено (Выполненные)'"));
	//СписокВыбора.Добавить("СрокСегодня", 				НСтр("ru = 'Срок: сегодня'"));
	//СписокВыбора.Добавить("СрокЗавтра", 				НСтр("ru = 'Срок: завтра'"));
	//СписокВыбора.Добавить("СрокНеделя", 				НСтр("ru = 'Срок: 7 дней'"));	
КонецПроцедуры
//-- КонецЗадачи 2109
